000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектыПроблемныеДоВыяснения/ОбъектыПроблемныеДоВыяснения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыПроблемныеДоВыяснения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовДоВыяснения</types>
    </type>
  </resources>
  <resources>
    <name>Источник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МоментСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Альтернатива</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>DocumentRef.КорректировкаПеремещения</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <comment>Пустой - по всем магазинам</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОбъектыПроблемныеДоВыяснения/Forms/ФормаЗаписи/Module.bsl
&НаСервере	//	LNK 29.01.2019 14:37:24
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.Объект.ТолькоПросмотр = ЗначениеЗаполнено(Запись.Объект);

	УстановитьДанныеПредставление();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ТекущийОбъект.МоментСоздания = '00010101' И НЕ ТекущийОбъект.Объект = Неопределено Тогда

		ТекущийОбъект.МоментСоздания = ОбщегоНазначенияКлиентСервер.УникальныйИдентификаторВремя(ТекущийОбъект.Объект.УникальныйИдентификатор());

	КонецЕсли;

КонецПроцедуры

&НаСервере	//	LNK 18.11.2019 10:12:01
Процедура УстановитьДанныеПредставление()

	Элементы.ДанныеПредставление.Видимость = Ложь;

	Если ЗначениеЗаполнено(Запись.Объект) Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаРегистра.Данные КАК Данные
		|ИЗ
		|	РегистрСведений.ОбъектыПроблемныеДоВыяснения КАК ТаблицаРегистра
		|ГДЕ
		|	ТаблицаРегистра.Период = &Период
		|	И ТаблицаРегистра.Объект = &Объект
		|	И ТаблицаРегистра.Магазин = &Магазин"
		);
		Запрос.УстановитьПараметр("Период", Запись.ИсходныйКлючЗаписи.Период);
		Запрос.УстановитьПараметр("Объект", Запись.ИсходныйКлючЗаписи.Объект);
		Запрос.УстановитьПараметр("Магазин", Запись.ИсходныйКлючЗаписи.Магазин);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда

			ЗначениеДанных = Выборка.Данные.Получить();

			Если ТипЗнч(ЗначениеДанных) = Тип("Структура") И НЕ ЗначениеДанных.Количество() = 0 Тогда

				Элементы.ДанныеПредставление.Видимость = Истина;

				ДанныеПредставление = ОбщегоНазначенияКлиентСервер.СтруктураПредставление("Хранимые Данные", ЗначениеДанных);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
